app/controllers/resguardos_controller.rb

SELECT "resguardos".* FROM "resguardos"
---
  def index
    @resguardos = Resguardo.all

INSERT INTO "resguardos" ("concepto", "conectividad", "created_at", "descripcion", "estado", "f_compra", "garantia", "marca", "modelo", "no_resguardo", "no_serie", "notas", "peso", "precio", "proveedor", "ubicacion", "updated_at", "valor_actual") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @resguardo = Resguardo.new(resguardo_params)

    respond_to do |format|
      if @resguardo.save

UPDATE "resguardos" SET "descripcion" = ?, "notas" = ?, "updated_at" = ? WHERE "resguardos"."id" = 8  [["descripcion", "Bocina para perifoneo "], ["notas", "Color Plateado Gris 40W"], ["updated_at", Fri, 07 Mar 2014 03:08:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @resguardo.update(resguardo_params)

DELETE FROM "resguardos" WHERE "resguardos"."id" = ?  [["id", 1]]
---
  def destroy
    @resguardo.destroy

SELECT "resguardos".* FROM "resguardos" WHERE "resguardos"."id" = ? LIMIT 1  [["id", "4"]]
---
    def set_resguardo
      @resguardo = Resguardo.find(params[:id])